GopalSaraf/Practicals/PSDL/include/proc/pic18f47k40.inc
// Register: WPUC
#define WPUC WPUC
WPUC                                     equ 0F20h
// bitfield definitions
WPUC_WPUC0_POSN                          equ 0000h
WPUC_WPUC0_POSITION                      equ 0000h
WPUC_WPUC0_SIZE                          equ 0001h
WPUC_WPUC0_LENGTH                        equ 0001h
WPUC_WPUC0_MASK                          equ 0001h
WPUC_WPUC1_POSN                          equ 0001h
WPUC_WPUC1_POSITION                      equ 0001h
WPUC_WPUC1_SIZE                          equ 0001h
WPUC_WPUC1_LENGTH                        equ 0001h
WPUC_WPUC1_MASK                          equ 0002h
WPUC_WPUC2_POSN                          equ 0002h
WPUC_WPUC2_POSITION                      equ 0002h
WPUC_WPUC2_SIZE                          equ 0001h
WPUC_WPUC2_LENGTH                        equ 0001h
WPUC_WPUC2_MASK                          equ 0004h
WPUC_WPUC3_POSN                          equ 0003h
WPUC_WPUC3_POSITION                      equ 0003h
WPUC_WPUC3_SIZE                          equ 0001h
WPUC_WPUC3_LENGTH                        equ 0001h
WPUC_WPUC3_MASK                          equ 0008h
WPUC_WPUC4_POSN                          equ 0004h
WPUC_WPUC4_POSITION                      equ 0004h
WPUC_WPUC4_SIZE                          equ 0001h
WPUC_WPUC4_LENGTH                        equ 0001h
WPUC_WPUC4_MASK                          equ 0010h
WPUC_WPUC5_POSN                          equ 0005h
WPUC_WPUC5_POSITION                      equ 0005h
WPUC_WPUC5_SIZE                          equ 0001h
WPUC_WPUC5_LENGTH                        equ 0001h
WPUC_WPUC5_MASK                          equ 0020h
WPUC_WPUC6_POSN                          equ 0006h
WPUC_WPUC6_POSITION                      equ 0006h
WPUC_WPUC6_SIZE                          equ 0001h
WPUC_WPUC6_LENGTH                        equ 0001h
WPUC_WPUC6_MASK                          equ 0040h
WPUC_WPUC7_POSN                          equ 0007h
WPUC_WPUC7_POSITION                      equ 0007h
WPUC_WPUC7_SIZE                          equ 0001h
WPUC_WPUC7_LENGTH                        equ 0001h
WPUC_WPUC7_MASK                          equ 0080h

// Register: ANSELC
#define ANSELC ANSELC
ANSELC                                   equ 0F21h
// bitfield definitions
ANSELC_ANSELC0_POSN                      equ 0000h
ANSELC_ANSELC0_POSITION                  equ 0000h
ANSELC_ANSELC0_SIZE                      equ 0001h
ANSELC_ANSELC0_LENGTH                    equ 0001h
ANSELC_ANSELC0_MASK                      equ 0001h
ANSELC_ANSELC1_POSN                      equ 0001h
ANSELC_ANSELC1_POSITION                  equ 0001h
ANSELC_ANSELC1_SIZE                      equ 0001h
ANSELC_ANSELC1_LENGTH                    equ 0001h
ANSELC_ANSELC1_MASK                      equ 0002h
ANSELC_ANSELC2_POSN                      equ 0002h
ANSELC_ANSELC2_POSITION                  equ 0002h
ANSELC_ANSELC2_SIZE                      equ 0001h
ANSELC_ANSELC2_LENGTH                    equ 0001h
ANSELC_ANSELC2_MASK                      equ 0004h
ANSELC_ANSELC3_POSN                      equ 0003h
ANSELC_ANSELC3_POSITION                  equ 0003h
ANSELC_ANSELC3_SIZE                      equ 0001h
ANSELC_ANSELC3_LENGTH                    equ 0001h
ANSELC_ANSELC3_MASK                      equ 0008h
ANSELC_ANSELC4_POSN                      equ 0004h
ANSELC_ANSELC4_POSITION                  equ 0004h
ANSELC_ANSELC4_SIZE                      equ 0001h
ANSELC_ANSELC4_LENGTH                    equ 0001h
ANSELC_ANSELC4_MASK                      equ 0010h
ANSELC_ANSELC5_POSN                      equ 0005h
ANSELC_ANSELC5_POSITION                  equ 0005h
ANSELC_ANSELC5_SIZE                      equ 0001h
ANSELC_ANSELC5_LENGTH                    equ 0001h
ANSELC_ANSELC5_MASK                      equ 0020h
ANSELC_ANSELC6_POSN                      equ 0006h
ANSELC_ANSELC6_POSITION                  equ 0006h
ANSELC_ANSELC6_SIZE                      equ 0001h
ANSELC_ANSELC6_LENGTH                    equ 0001h
ANSELC_ANSELC6_MASK                      equ 0040h
ANSELC_ANSELC7_POSN                      equ 0007h
ANSELC_ANSELC7_POSITION                  equ 0007h
ANSELC_ANSELC7_SIZE                      equ 0001h
ANSELC_ANSELC7_LENGTH                    equ 0001h
ANSELC_ANSELC7_MASK                      equ 0080h

// Register: INLVLD
#define INLVLD INLVLD
INLVLD                                   equ 0F22h
// bitfield definitions
INLVLD_INLVLD0_POSN                      equ 0000h
INLVLD_INLVLD0_POSITION                  equ 0000h
INLVLD_INLVLD0_SIZE                      equ 0001h
INLVLD_INLVLD0_LENGTH                    equ 0001h
INLVLD_INLVLD0_MASK                      equ 0001h
INLVLD_INLVLD1_POSN                      equ 0001h
INLVLD_INLVLD1_POSITION                  equ 0001h
INLVLD_INLVLD1_SIZE                      equ 0001h
INLVLD_INLVLD1_LENGTH                    equ 0001h
INLVLD_INLVLD1_MASK                      equ 0002h
INLVLD_INLVLD2_POSN                      equ 0002h
INLVLD_INLVLD2_POSITION                  equ 0002h
INLVLD_INLVLD2_SIZE                      equ 0001h
INLVLD_INLVLD2_LENGTH                    equ 0001h
INLVLD_INLVLD2_MASK                      equ 0004h
INLVLD_INLVLD3_POSN                      equ 0003h
INLVLD_INLVLD3_POSITION                  equ 0003h
INLVLD_INLVLD3_SIZE                      equ 0001h
INLVLD_INLVLD3_LENGTH                    equ 0001h
INLVLD_INLVLD3_MASK                      equ 0008h
INLVLD_INLVLD4_POSN                      equ 0004h
INLVLD_INLVLD4_POSITION                  equ 0004h
INLVLD_INLVLD4_SIZE                      equ 0001h
INLVLD_INLVLD4_LENGTH                    equ 0001h
INLVLD_INLVLD4_MASK                      equ 0010h
INLVLD_INLVLD5_POSN                      equ 0005h
INLVLD_INLVLD5_POSITION                  equ 0005h
INLVLD_INLVLD5_SIZE                      equ 0001h
INLVLD_INLVLD5_LENGTH                    equ 0001h
INLVLD_INLVLD5_MASK                      equ 0020h
INLVLD_INLVLD6_POSN                      equ 0006h
INLVLD_INLVLD6_POSITION                  equ 0006h
INLVLD_INLVLD6_SIZE                      equ 0001h
INLVLD_INLVLD6_LENGTH                    equ 0001h
INLVLD_INLVLD6_MASK                      equ 0040h
INLVLD_INLVLD7_POSN                      equ 0007h
INLVLD_INLVLD7_POSITION                  equ 0007h
INLVLD_INLVLD7_SIZE                      equ 0001h
INLVLD_INLVLD7_LENGTH                    equ 0001h
INLVLD_INLVLD7_MASK                      equ 0080h

